/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aokur <aokur@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/07/29 16:10:33 by aokur             #+#    #+#             */
/*   Updated: 2025/07/30 18:42:48 by aokur            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "printf.h"
#include <stdio.h>

int	main(int argc, char **argv)
{
	int i = 25;
	printf("%p\n", &i);
	printf("\nTOPLAM: %d", ft_printf("%p", &i)); // Ne yazdırıyor?
}
